{
    "npm": "Npm — менеджер пакетов, входящий в состав Node.js. С помощью менеджера npm можно добавить в проект огромное количество всевозможных библиотек и инструментов. С помощью npm можно устанавливать пакеты локально или глобально. В локальном режиме пакеты устанавливаются в каталог node_modules родительского каталога. Владельцем каталога является текущий пользователь. Глобальные пакеты устанавливаются в каталог {prefix}/lib/node_modules/, владельцем которого является root.",
    "ux/ui": "UX (англ. user experience) дословно означает «опыт пользователя». В более широком смысле это понятие про весь опыт, который получает пользователь при взаимодействии с сайтом или приложением. UI (англ. user interface) переводится как «пользовательский интерфейс». И необязательно только графический: тактильный, голосовой или звуковой. Мы рассмотрим только графический интерфейс, так как дизайнеры в основном работают с ним.",
    "javascript": "Интерпретируемый язык программирования, который используется для разработки как клиентской части, так и серверной части веб-приложений.",
    "фреймворк": "Платформа для разработки программных приложений.",
    "api": "Application programming interface – это набор команд, функций, протоколов и объектов, которые программисты могут использовать для создания программного обеспечения или взаимодействия с внешней системой",
    "sql injection": "SQL injection — один из распространённых способов взлома сайтов и программ, работающих с базами данных, основанный на внедрении в запрос произвольного SQL-кода. Говоря простым языком — это атака на базу данных, которая позволит выполнить некоторое действие, которое не планировалось создателем скрипта.",
    "xss scripting": "XSS (межсайтовый скриптинг) – одна из разновидностей атак на веб-системы, которая подразумевает внедрение вредоносного кода на определенную страницу сайта и взаимодействие этого кода с удаленным сервером злоумышленников при открытии страницы пользователем. ",
    "cookie": "Cookie – файлы позволяют сохранять на стороне клиента некоторые данные в течении заданного интервала времени, которые при смене страницы или повторном заходе на сайт помогают идентифицировать пользователя и, например, помогают восстановить состояние предыдущей сессии.",
    "ddos": "Распределенная атака типа «отказ в обслуживании», или DDoS— это самая настоящая бомбардировка центрального сервера одновременными запросами данных. Злоумышленник отправляет такие запросы из нескольких взломанных систем. Таким образом он пытается полностью занять интернет-канал и истощить ресурсы ОЗУ компании-жертвы. Конечная цель состоит в выводе из строя систем такой компании и прерывании ее бизнес-процессов.",
    "nginx": "Nginx — это HTTP-сервер и обратный прокси-сервер, почтовый прокси-сервер, а также TCP/UDP прокси-сервер общего назначения, изначально написанный Игорем Сысоевым. Уже длительное время он обслуживает серверы многих высоконагруженных российских сайтов, таких как Яндекс, Mail.Ru, ВКонтакте и Рамблер.",
    "aws Shield": "AWS Shield – это управляемый сервис защиты от атак типа «распределенный отказ в обслуживании» (DDoS). Он защищает приложения, работающие на AWS. AWS Shield обеспечивает непрерывное обнаружение и автоматическую линейную нейтрализацию атак, сокращая время простоя и задержку приложений и избавляя пользователя от необходимости обращаться в службу поддержки AWS в случае DDoS-атак. AWS предлагает два уровня AWS Shield – Standard и Advanced.",
    "linter": "Инструмент для форматирования кода помогает мне избегать глупых ошибок при написании JavaScript. Несмотря на многолетний опыт, почти все программисты неправильно набираю имена переменных, делают синтаксические ошибки и забывают правильно обрабатывать их. Хороший инструмент для линтинга также может помочь убедиться, что проект соответствует стандарту кодирования.",
    "tls": "Протокол TLS (transport layer security) основан на протоколе SSL (Secure Sockets Layer), изначально разработанном в Netscape для повышения безопасности электронной коммерции в Интернете. Протокол SSL был реализован на application-уровне, непосредственно над TCP (Transmission Control Protocol), что позволяет более высокоуровневым протоколам (таким как HTTP или протоколу электронной почты) работать без изменений.",
    "helmet": "Helmet помогает защитить приложение от некоторых широко известных веб-уязвимостей путем соответствующей настройки заголовков HTTP. Helmet, по сути, представляет собой набор из девяти более мелких функций промежуточной обработки, обеспечивающих настройку заголовков HTTP, связанную с защитой."
}